v2206/solver_ADMFoam/cavityADM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 -0.01)
    (1 0 -0.01)
    (1 1 -0.01)
    (0 1 -0.01)
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
);

blocks
(
    // hex (0 1 2 3 4 5 6 7)
    // (4 4 1) 
    // simpleGrading (1 1 1)

    hex (0 1 2 3 4 5 6 7) 
    (160 160 1)
    simpleGrading 
    (
        // x-axis
        (
            (0.5 0.5 8)
            (0.5 0.5 0.125)
        )
        // y-axis
        (
            (0.5 0.5 8)
            (0.5 0.5 0.125)
        )
        // z-axis
        1
    )
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
